In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [35]:
dict1={"Names":["Aravind","Samar",np.nan,"Siri"],"Age":[np.nan,21,32,43],"City":["Hyd","Blr","Chennai",np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [36]:
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [6]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [8]:
dict2={"Names":["Aravind","Samar",None,"Siri"],"Age":[np.nan,21,32,43],"City":["Hyd","Blr","Chennai",None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [9]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [10]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

- np.nan: not a number this applicable for numerical columns only

- Generally data has some empty rows
- it is a data problem
- If you need that kind of data you will see null
- you need to understand it is a data corrupted or really a Null values are there

**Method-1**

***Fill with some random value***

**Method name**: fill na

In [12]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [13]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

***Method-2***

- we can fill the values with respect to columns also

In [18]:
d1["Age"].fillna(40)
#it will not updated
#inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [19]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [26]:
d1["Age"].fillna(40,inplace=True)

In [29]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2   Sushma  32.0  Chennai
3     Siri  43.0      NaN

In [27]:
d1["Names"].fillna("Sushma",inplace=True)

In [28]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2   Sushma  32.0  Chennai
3     Siri  43.0      NaN

In [30]:
d1["City"].fillna("Ndl",inplace=True)

In [31]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2   Sushma  32.0  Chennai
3     Siri  43.0      Ndl

***Method-3***

- bfill
- ffill
- pad
- backfill

In [44]:
d1.fillna(method="bfill")
#column1:names index 4 is missing values it is filled with index 3 value
#column2:age index 1 is missing values it is filled with index 2 value
#column3:city index 4 is missing values it should be filled with next value ,but we have no next value

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\235235239.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="bfill")

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [40]:
d1.fillna(method="ffill")

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\4243749665.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="ffill")

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [41]:
d1.fillna(method="pad")

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\1472097110.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="pad")

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [42]:
d1.fillna(method="backfill")

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\3993376519.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="backfill")

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [46]:
d1.fillna(method="bfill",axis=1)

#axis 1 means columns soo the nan values fill with next column values

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\2451549200.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="bfill",axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [47]:
d1.fillna(method="ffill",axis=1)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\3367346003.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="ffill",axis=1)

     Names      Age     City
0  Aravind  Aravind      Hyd
1    Samar     21.0      Blr
2      NaN     32.0  Chennai
3     Siri     43.0     43.0

In [48]:
d1.fillna(method="backfill",axis=1)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\1445519270.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="backfill",axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [49]:
d1.fillna(method="pad",axis=1)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_3488\863482406.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="pad",axis=1)

     Names      Age     City
0  Aravind  Aravind      Hyd
1    Samar     21.0      Blr
2      NaN     32.0  Chennai
3     Siri     43.0     43.0

- backfill and bfill fill with next value
- pad and ffill fill with previous value
- but it will change based on axis

***Method-4***

- Mean
    - numerical values can fill with mean value
    - but mean will affect by outliers
    - if we dont have outliers it is best one

- Median
   - Numerical values can fill with median value
   - we know that median value does not affect with outliers
   - so ifoutliers are there we can go with median

- Mode
    - Mode is useful for categorical data

In [50]:
dict1={"Names":["Aravind","Samar",np.nan,"Siri"],"Age":[np.nan,21,32,43],"City":["Hyd","Blr","Chennai",np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [51]:
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [52]:
# we already know we can fill with some values based on specific column using fillna
#d1.fillna(<random_number>)
#d1 represents all the columns
age_mean=d1["Age"].mean()
d1["Age"].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [53]:
age_median=d1["Age"].median()
d1["Age"].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [54]:
age_mode=d1["Age"].mode()
d1["Age"].fillna(age_mode)

0    21.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [56]:
d1["City"].mode()

#in this usecase we are getting mode equal
#but in realtime we will get clear mode value

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random value 
- Fill with random value on specific value
- Fill with methods
   - bfill
   - ffill
   - pad
   - backfill
- Fill with mean,median,mode

***Method-5***

**KNN imputer**

- KNN means k nearest neighbours
- K is a hyper parameter means user can choose
- It is distance metric: **Euclidian distance**
- KNN imputer will take the mean of the neighbours value
-  the neighbours value can provided by using value=k
-  It is under the sklearn package
-  Under sklearn we have imputer method
-  Under imputer method we have KnnImputer
-  Applicable only for numerical data

In [61]:
from sklearn.impute import KNNImputer
ki=KNNImputer()
ki.fit_transform(d1[["Age"]])

array([[32.],
       [21.],
       [32.],
       [43.]])